// tslint:disable-next-line: class-name
export class SelectCity {
  id: number;
  name: string;
  selectCity = [];

  city(c) {
    switch (c) {
      case 'منطقة الرياض':
        this.selectCity = [
          { id: 1, name: 'الأفلاج (محافظة)' },
          { id: 2, name: 'البجادية' },
          { id: 3, name: 'الجريفة' },
          { id: 4, name: 'الحريق (الرياض)' },
          { id: 5, name: 'الحفيرة' },
          { id: 6, name: 'الحفيرة (الدوادمي)' },
          { id: 7, name: 'الداهنة' },
          { id: 8, name: 'الدرعية' },
          { id: 9, name: 'الدلم' },
          { id: 10, name: 'الرياض' },
          { id: 11, name: 'الزلفي' },
          { id: 12, name: 'السليل' },
          { id: 13, name: 'السيح' },
          { id: 14, name: 'العيينة' },
          { id: 15, name: 'العيينة والجبيلة (الدرعية)' },
          { id: 16, name: 'الغاط' },
          { id: 17, name: 'اللهابة' },
          { id: 18, name: 'المجمعة' },
          { id: 19, name: 'حريملاء' },
          { id: 20, name: 'رماح' },
          { id: 21, name: 'رويضة العرض' },
          { id: 22, name: 'ضرما' },
          { id: 23, name: 'قصر الربيعة' },
          { id: 24, name: 'قصور آل مقبل (ضرما)' },
          { id: 25, name: 'كمدة' },
          { id: 26, name: 'محافظة الخرج' },
          { id: 27, name: 'محافظة الدوادمي' },
          { id: 28, name: 'محافظة الرين' },
          { id: 29, name: 'محافظة القويعية' },
          { id: 30, name: 'محافظة المزاحمية' },
          { id: 31, name: 'محافظة ثادق' },
          { id: 32, name: 'محافظة حوطة بني تميم' },
          { id: 33, name: 'محافظة شقراء' },
          { id: 34, name: 'محافظة عفيف' },
          { id: 35, name: 'محافظة مرات' },
          { id: 36, name: 'مدينة الرويضة' },
          { id: 37, name: 'مدينة الرين' },
          { id: 39, name: 'وادي الدواسر (محافظة)' }
        ];
        break;

      case 'منطقة مكة المكرمة':
        this.selectCity = [
          { id: 1,  name: 'أحد بني زيد' },
          { id: 2,  name: 'أضم' },
          { id: 3,  name: 'البيضاء (مكة المكرمة)' },
          { id: 4,  name: 'الحوية' },
          { id: 5,  name: 'الخرمة' },
          { id: 6,  name: 'السعدية (محافظة الليث)' },
          { id: 7,  name: 'الصهوة' },
          { id: 8,  name: 'الطائف' },
          { id: 9,  name: 'الغالة' },
          { id: 10, name: 'القنفذة' },
          { id: 11, name: 'القوز (محافظة القنفذة)' },
          { id: 12, name: 'الكامل' },
          { id: 13, name: 'الليث' },
          { id: 14, name: 'المضيلف' },
          { id: 15, name: 'المظيلف' },
          { id: 16, name: 'المويه' },
          { id: 17, name: 'الهدا' },
          { id: 18, name: 'بحرة (مكة)' },
          { id: 19, name: 'بلدة الحبيل' },
          { id: 20, name: 'تربة (مدينة)' },
          { id: 21, name: 'ثريبان (العرضيات)' },
          { id: 22, name: 'جدة' },
          { id: 23, name: 'حلي (مدينة)' },
          { id: 24, name: 'خليص' },
          { id: 25, name: 'دوقة' },
          { id: 26, name: 'رنية' },
          { id: 27, name: 'محافظة العرضيات' },
          { id: 28, name: 'مركز كنانة' },
          { id: 29, name: 'مستورة' },
          { id: 30, name: 'ميسان' },
          { id: 31, name: '' }
        ];
        break;

        case 'منطقة المدينة المنورة':
        this.selectCity = [
          { id: 1,  name: 'أم المخاييل' },
          { id: 2,  name: 'الباطح' },
          { id: 3,  name: 'الجياسر' },
          { id: 4,  name: 'الحسو' },
          { id: 5,  name: 'الحناكية' },
          { id: 6,  name: 'الرايس' },
          { id: 7,  name: 'الرذايا' },
          { id: 8,  name: 'العلا' },
          { id: 9,  name: 'الفريش' },
          { id: 10, name: 'المسيجيد' },
          { id: 11, name: 'الواسطة (بدر)' },
          { id: 12, name: 'بدر (محافظة)' },
          { id: 13, name: 'خيبر' },
          { id: 14, name: 'دثير' },
          { id: 15, name: 'الفرع' },
          { id: 16, name: 'المدينة المنورة' },
          { id: 17, name: 'مهد الذهب' },
          { id: 18, name: 'ينبع' },
          { id: 19, name: 'ينبع الصناعية' }
        ];
        break;

        case 'منطقة القصيم':
        this.selectCity = [
          { id: 1,  name: 'الأسياح (محافظة)' },
          { id: 2,  name: 'البكيرية' },
          { id: 3,  name: 'الرس (محافظة)' },
          { id: 4,  name: 'الشماسية' },
          { id: 5,  name: 'المذنب' },
          { id: 6,  name: 'النبهانية' },
          { id: 7,  name: 'ضرية (محافظة)' },
          { id: 8,  name: 'عقلة الصقور' },
          { id: 9,  name: 'عنيزة' },
          { id: 10, name: 'عيون الجواء' },
          { id: 11, name: 'محافظة البدائع' },
          { id: 12, name: 'محافظة رياض الخبراء' }
        ];
        break;

        case 'المنطقة الشرقية':
        this.selectCity = [
          { id: 1,  name: 'الأحساء (مدينة)' },
          { id: 2,  name: 'الجبيل2' },
          { id: 3,  name: 'الظهران' },
          { id: 4,  name: 'العيون' },
          { id: 5,  name: 'القيصومة' },
          { id: 6,  name: 'الهفوف' },
          { id: 7,  name: 'محافظة الجبيل' },
          { id: 8,  name: 'حفر الباطن' },
          { id: 9,  name: 'محافظة الخبر' },
          { id: 10, name: 'الدمام' },
          { id: 11, name: 'رأس تنورة' },
          { id: 12, name: 'سيهات' },
          { id: 13, name: 'محافظة النعيرية' }
        ];
        break;

        case 'منطقة عسير':
        this.selectCity = [
          { id: 1,  name: 'آل فصيل' },
          { id: 2,  name: 'أبها' },
          { id: 3,  name: 'البرك (عسير)' },
          { id: 4,  name: 'الحرجة' },
          { id: 5,  name: 'الربوعة' },
          { id: 6,  name: 'باحة ربيعة' },
          { id: 7,  name: 'المدرسة السعودية (بيشة)' },
          { id: 8,  name: 'بارق (محافظة)' },
          { id: 9,  name: 'بللسمر (عسير)' },
          { id: 10,  name: 'تندحة' },
          { id: 11, name: 'تنومة' },
          { id: 12, name: 'حجلا' },
          { id: 13, name: 'خميس مشيط' },
          { id: 14, name: 'سبت العلاية' },
          { id: 15, name: 'سراة عبيدة' },
          { id: 16, name: 'ظهران الجنوب' },
          { id: 17, name: 'قضريمة' },
          { id: 18, name: 'قنا' },
          { id: 19, name: 'محافظة بيشة' },
          { id: 20, name: 'محافظة تثليث' },
          { id: 21, name: 'محايل عسير' },
          { id: 22, name: 'مركز بللحمر' },
          { id: 23, name: 'مركز خاط' },
          { id: 24, name: 'وادي بن هشبل' }
        ];
        break;

        case 'منطقة تبوك':
        this.selectCity = [
          { id: 1,  name: 'أملج (تبوك)' },
          { id: 2,  name: 'الوجه' },
          { id: 3,  name: 'بئر بن هرماس' },
          { id: 4,  name: 'تيماء (مدينة)' },
          { id: 5,  name: 'ضباء (محافظة)' },
          { id: 6,  name: 'محافظة تيماء' },
          { id: 7,  name: 'محافظة حقل' },
          { id: 8,  name: 'مقنا' }
        ];
        break;

        case 'منطقة حائل':
        this.selectCity = [
          { id: 1,  name: 'الحفير' },
          { id: 2,  name: 'الروضة (حائل)' },
          { id: 3,  name: 'الغزالة (محافظة)' },
          { id: 4,  name: 'القاعد' },
          { id: 5,  name: 'النحيتية' },
          { id: 6,  name: 'بقعاء' },
          { id: 7,  name: 'تربة (حائل)' },
          { id: 8,  name: 'ثويليل' },
          { id: 9,  name: 'جبة' },
          { id: 10, name: 'الحائط' },
          { id: 11, name: 'حائل' },
          { id: 12, name: 'سميراء' },
          { id: 13, name: 'الشنان' },
          { id: 14, name: 'فيد' },
          { id: 15, name: 'قفار' },
          { id: 16, name: 'موقق' },
          { id: 17, name: 'الشملي' }
        ];
        break;

        case 'منطقة الحدود الشمالية':
        this.selectCity = [
          { id: 1,  name: 'عرعر' },
          { id: 2,  name: 'رفحاء' },
          { id: 3,  name: 'طريف' },
          { id: 4,  name: 'العويقيلة' },
          { id: 5,  name: 'جديدة عرعر' },
          { id: 6,  name: 'شعبة نصاب' }
        ];
        break;

        case 'منطقة جازان':
        this.selectCity = [
          { id: 1,  name: 'أبو عريش' },
          { id: 2,  name: 'جزر فرسان' },
          { id: 3,  name: 'فيفاء' },
          { id: 4,  name: 'محافظة أحد المسارحة' },
          { id: 5,  name: 'محافظة الحرث' },
          { id: 6,  name: 'محافظة الدائر' },
          { id: 7,  name: 'محافظة الدرب' },
          { id: 8,  name: 'محافظة الريث' },
          { id: 9,  name: 'محافظة الطوال' },
          { id: 10, name: 'محافظة العارضة' },
          { id: 11, name: 'محافظة العيدابي' },
          { id: 12, name: 'محافظة بيش' },
          { id: 13, name: 'محافظة صامطة' },
          { id: 14, name: 'محافظة صبيا' },
          { id: 15, name: 'محافظة ضمد' },
          { id: 16, name: 'محافظة هروب' }
        ];
        break;

        case 'منطقة نجران':
        this.selectCity = [
          { id: 1,  name: 'نجرا' },
          { id: 2,  name: 'شرورة' },
          { id: 3,  name: 'حبونا' },
          { id: 4,  name: 'ثار' },
          { id: 5,  name: 'يدمه' },
          { id: 6,  name: 'بدر الجنوب' },
          { id: 7,  name: 'خباش' },
          { id: 8,  name: 'الخرخير' }
        ];
        break;

        case 'منطقة الباحة':
        this.selectCity = [
          { id: 1,  name: 'الحجرة (محافظة)' },
          { id: 2,  name: 'الحلاة' },
          { id: 3,  name: 'الرميضة' },
          { id: 4,  name: 'الشعراء (الباحة)' },
          { id: 5,  name: 'الشوق' },
          { id: 6,  name: 'الصفاردة' },
          { id: 7,  name: 'محافظة العقيق' },
          { id: 8,  name: 'المخواة' },
          { id: 9,  name: 'بني حسن' },
          { id: 10, name: 'حصن الحبس' },
          { id: 11, name: 'رغدان' },
          { id: 12, name: 'غامد الزناد' },
          { id: 13, name: 'قرى وادي الحضن السويدي' },
          { id: 14, name: 'قرى وادي الشعراء' },
          { id: 15, name: 'قرى وادي ريم' },
          { id: 16, name: 'قرى وادي كروان السويدي' },
          { id: 17, name: 'محافظة القرى' },
          { id: 18, name: 'محافظة المندق' },
          { id: 19, name: 'محافظة بلجرشي' },
          { id: 20, name: 'محافظة قلوة' },
          { id: 21, name: 'وادي نيرا' }
        ];
        break;

        case 'منطقة الجوف':
        this.selectCity = [
          { id: 1,  name: 'محافظة دومة الجندل‏' },
          { id: 2,  name: 'محافظة سكاكا' },
          { id: 3,  name: 'محافظة القريات' },
          { id: 4,  name: 'محافظة طبرجل' }
        ];
        break;

      default:
        break;
    }

    return this.selectCity;
  }
}
